Catalogs/ШаблоныПроводокДляМеждународногоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ШаблоныПроводокДляМеждународногоУчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДебетаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКредитаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточникаУточненияСчетаДт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИсточниковУточненияСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточникаУточненияСчетаКт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИсточниковУточненияСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПодразделенияДт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПодразделенийАналитическихРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПодразделенияКт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПодразделенийАналитическихРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСуммыВВалютеДт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоказателиАналитическихРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСуммыВВалютеКт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоказателиАналитическихРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникБалансовойСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоказателиАналитическихРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменятьЗнакОперацииПриОтраженииВУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучноеУточнениеПроводки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйОтбор</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленДополнительныйОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСовместногоПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСовместногоПримененияШаблоновПроводок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппаШаблонов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Игнорировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеСубконтоПоСоответствию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникНаправленияДт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиНаправленийДеятельностиАналитическихРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникНаправленияКт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиНаправленийДеятельностиАналитическихРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникКоличестваДт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоказателиАналитическихРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникКоличестваКт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоказателиАналитическихРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиЗаполненияСубконто</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоложениеСубконто</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСубконто</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоМеждународные</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаполнятьИзИсточника</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УказанноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеВыражения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПравилаОтраженияВМеждународномУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПравилаОтраженияВМеждународномУчете</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>УчетнаяПолитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеПолитики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонПроводки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоответствияСчетовМеждународногоУчета</v8:Type>
						<v8:Type>cfg:CatalogRef.СоответствияОборотовМеждународногоУчета</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроводокДляМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ШаблоныПроводокДляМеждународногоУчета/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Родитель") И ЗначениеЗаполнено(ДанныеЗаполнения.Родитель) Тогда
			РодительГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Родитель, "ЭтоГруппаШаблонов");
			Если Не РодительГруппа Тогда
				ДанныеЗаполнения.Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Родитель, "Родитель");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппаШаблонов Тогда
		ПроверяемыеРеквизиты.Очистить();
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	ИсточникДанных = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Операция, "ИсточникДанных");
	ПоказателиВВалюте = МеждународныйУчетСерверПовтИсп.ПоказателиВВалюте(ИсточникДанных);
	ПоказателиКоличества = МеждународныйУчетСерверПовтИсп.ПоказателиКоличества(ИсточникДанных);
	
	Если Не МеждународныйУчетСерверПовтИсп.СвойстваСчета(СчетДебетаПоУмолчанию).Валютный
		Или ПоказателиВВалюте = Неопределено
		ИЛИ (ПоказателиВВалюте <> Неопределено И ПоказателиВВалюте.Количество() = 0) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ИсточникСуммыВВалютеДт");
	КонецЕсли;
	
	Если Не МеждународныйУчетСерверПовтИсп.СвойстваСчета(СчетКредитаПоУмолчанию).Валютный
		ИЛИ ПоказателиВВалюте = Неопределено
		ИЛИ (ПоказателиВВалюте <> Неопределено И ПоказателиВВалюте.Количество() = 0) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ИсточникСуммыВВалютеКт");
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Для количественного счета %1 не указан источник количества.';uk='Для кількісного рахунку %1 не вказано джерело кількості.'");
	Если МеждународныйУчетСерверПовтИсп.СвойстваСчета(СчетДебетаПоУмолчанию).Количественный
		И НЕ ЗначениеЗаполнено(ИсточникКоличестваДт)Тогда
		ОшибкаСчета = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СчетДебетаПоУмолчанию);
		ОбщегоНазначения.СообщитьПользователю(ОшибкаСчета, Ссылка);
	КонецЕсли;
	
	Если МеждународныйУчетСерверПовтИсп.СвойстваСчета(СчетКредитаПоУмолчанию).Количественный
		И НЕ ЗначениеЗаполнено(ИсточникКоличестваКт) Тогда
		ОшибкаСчета = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СчетКредитаПоУмолчанию);
		ОбщегоНазначения.СообщитьПользователю(ОшибкаСчета, Ссылка);
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	Если НЕ ЗаполнениеСубконтоПоСоответствию Тогда
		НастройкиЗаполненияСубконто.Очистить();
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ИндексКартинки = Справочники.ШаблоныПроводокДляМеждународногоУчета.ИндексКартинки(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли; 
	
	Если ПометкаУдаления Тогда
		НаборЗаписей = РегистрыСведений.ПравилаОтраженияВМеждународномУчете.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ШаблонПроводки.Установить(Ссылка);
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
